Prepared - import pandas, writing functions

In [1]:
import pandas as pd

# creating function for column name replace
def text_correct(text):
    return text.lower().replace(' ', '_')

reading file 'booking'

In [2]:
b = pd.read_csv('material/bookings.csv', sep = ';')

explorating the new dataframe

In [3]:
b.shape

(119390, 21)

In [4]:
b.shape[0]

119390

explorating the data types of dataframe

In [5]:
b.dtypes.value_counts()

object     10
int64      10
float64     1
dtype: int64

In [6]:
b.head(7)

,Hotel,Is Canceled,Lead Time,arrival full date,Arrival Date Year,Arrival Date Month,Arrival Date Week Number,Arrival Date Day of Month,Stays in Weekend nights,Stays in week nights,...,Adults,Children,Babies,Meal,Country,Reserved Room Type,Assigned room type,customer type,Reservation Status,Reservation status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
5,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
6,Resort Hotel,0,0,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-03

renaming the columns using function which we declare above

In [7]:
b.columns

Index(['Hotel', 'Is Canceled', 'Lead Time', 'arrival full date',
       'Arrival Date Year', 'Arrival Date Month', 'Arrival Date Week Number',
       'Arrival Date Day of Month', 'Stays in Weekend nights',
       'Stays in week nights', 'stays total nights', 'Adults', 'Children',
       'Babies', 'Meal', 'Country', 'Reserved Room Type', 'Assigned room type',
       'customer type', 'Reservation Status', 'Reservation status_date'],
      dtype='object')

In [8]:
b = b.rename(columns=text_correct)

In [9]:
b.head(7)

,hotel,is_canceled,lead_time,arrival_full_date,arrival_date_year,arrival_date_month,arrival_date_week_number,arrival_date_day_of_month,stays_in_weekend_nights,stays_in_week_nights,...,adults,children,babies,meal,country,reserved_room_type,assigned_room_type,customer_type,reservation_status,reservation_status_date
0,Resort Hotel,0,342,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
1,Resort Hotel,0,737,2015-07-01,2015,July,27,1,0,0,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-01
2,Resort Hotel,0,7,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,C,Transient,Check-Out,2015-07-02
3,Resort Hotel,0,13,2015-07-01,2015,July,27,1,0,1,...,1,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-02
4,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
5,Resort Hotel,0,14,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,GBR,A,A,Transient,Check-Out,2015-07-03
6,Resort Hotel,0,0,2015-07-01,2015,July,27,1,0,2,...,2,0.0,0,BB,PRT,C,C,Transient,Check-Out,2015-07-03

In [10]:
b.country.value_counts().head(7)

PRT    48590
GBR    12129
FRA    10415
ESP     8568
DEU     7287
ITA     3766
IRL     3375
Name: country, dtype: int64

defining country with most numbers of success reservations

In [11]:
# succes = b.query('is')

In [12]:
succes_df = b.query('is_canceled == 0').groupby('country', as_index=False) \
.agg({'is_canceled' : 'count'}) \
.sort_values('is_canceled', ascending=False) \
.rename(columns = {'is_canceled' : 'succes_number_reservation'})
succes_df.head(7)

    country  succes_number_reservation
125     PRT                      21071
57      GBR                       9676
54      FRA                       8481
50      ESP                       6391
42      DEU                       6069
70      IRL                       2543
75      ITA                       2433

alternative  solution

In [13]:
b.query('is_canceled == 0') \
    .country \
    .value_counts()[:5]

PRT    21071
GBR     9676
FRA     8481
ESP     6391
DEU     6069
Name: country, dtype: int64

finding nights means according hotel types

In [14]:
b.groupby('hotel')\
.agg({'stays_total_nights' : 'mean'})\
.round(2)

              stays_total_nights
hotel
City Hotel                  2.98
Resort Hotel                4.32

In [15]:
b.reserved_room_type.value_counts()

A    85994
D    19201
E     6535
F     2897
G     2094
B     1118
C      932
H      601
P       12
L        6
Name: reserved_room_type, dtype: int64

In [16]:
b.reserved_room_type[456]

'A'

In [17]:
b.assigned_room_type[456]

'A'

In [18]:
b.assigned_room_type.value_counts()

A    74053
D    25322
E     7806
F     3751
G     2553
C     2375
B     2163
H      712
I      363
K      279
P       12
L        1
Name: assigned_room_type, dtype: int64

We find out the quantity of booking which assigned room type differs from initial reservation. My solution

In [19]:
count = 0
for i in range(1, b.shape[0]):
    if b.reserved_room_type[i] != b.assigned_room_type[i]:
        count += 1

In [20]:
print(count)

14917

alternative solution

In [21]:
b.query('reserved_room_type != assigned_room_type').shape[0]

14917

In [22]:
b.query('reserved_room_type != assigned_room_type')[['reserved_room_type', 'assigned_room_type']]

       reserved_room_type assigned_room_type
2                       A                  C
12                      D                  E
15                      D                  E
17                      A                  E
18                      A                  G
...                   ...                ...
119273                  A                  K
119274                  A                  K
119289                  E                  F
119297                  D                  F
119357                  A                  D

[14917 rows x 2 columns]

We compare the number of success reservation by month of two years 2016 and 2017

In [23]:
b.query('is_canceled == 0') \
.query('arrival_date_year == 2016') \
.groupby(['arrival_date_year', 'arrival_date_month'], as_index=False)\
.agg({'is_canceled': 'count'})\
.sort_values('is_canceled', ascending =False)\
.rename(columns = {'is_canceled' : 'succes_number_reservation'}).head(5)

    arrival_date_year arrival_date_month  succes_number_reservation
10               2016            October                       3689
8                2016                May                       3563
11               2016          September                       3372
0                2016              April                       3367
7                2016              March                       3347

In [24]:
b.query('is_canceled == 0') \
.query('arrival_date_year == 2017') \
.groupby(['arrival_date_year', 'arrival_date_month'], as_index=False)\
.agg({'is_canceled': 'count'})\
.sort_values('is_canceled', ascending =False)\
.rename(columns = {'is_canceled' : 'succes_number_reservation'}).head(5)

   arrival_date_year arrival_date_month  succes_number_reservation
7               2017                May                       3551
4               2017               July                       3329
6               2017              March                       3298
5               2017               June                       3208
0               2017              April                       3198

alternative version

In [25]:
b.query('arrival_date_year == 2016') \
.query('is_canceled == 0') \
.arrival_date_month \
.value_counts().head(7)

October      3689
May          3563
September    3372
April        3367
March        3347
August       3238
June         3196
Name: arrival_date_month, dtype: int64

In [26]:
b.query('arrival_date_year == 2017') \
.query('is_canceled == 0') \
.arrival_date_month \
.value_counts()\
.head(7)

May         3551
July        3329
March       3298
June        3208
April       3198
August      3109
February    2818
Name: arrival_date_month, dtype: int64

In [27]:
b.hotel.unique()

array(['Resort Hotel', 'City Hotel'], dtype=object)

As we can see the most success month for reservation in 2016 was October\
and the most success month for reservation in 2017 was May

Here are we find month with most failed attemps according year

In [28]:
b.query('hotel == "City Hotel" and is_canceled == 1') \
.groupby(['arrival_date_year', 'arrival_date_month'], as_index=True)\
.agg({'is_canceled' : 'count'})\
.sort_values('is_canceled', ascending=False)\
.rename(columns= {'is_canceled' : 'failed_reservation'})

                                      failed_reservation
arrival_date_year arrival_date_month
2017              May                               2217
2016              October                           1947
2017              April                             1926
                  June                              1808
2016              June                              1720
                  September                         1567
2015              September                         1543
2016              April                             1539
                  May                               1436
                  November                          1360
2017              July                              1324
2015              October                           1321
2017              March                             1278
2016              August                            1247
2015              August                            1232
2017              August                            1123
2016              March                             1108
                  December                          1072
2017              January                           1044
2016              July                              1043
2017              February                           971
2015              July                               939
2016              February                           930
2015              December                           668
2016              January                            438
2015              November                           301

alternative solution by hotel type and canceled reservation by year and month

In [29]:
b.query('hotel == "City Hotel" and is_canceled == 1') \
    .groupby('arrival_date_year') \
    .arrival_date_month \
    .value_counts()

arrival_date_year  arrival_date_month
2015               September             1543
                   October               1321
                   August                1232
                   July                   939
                   December               668
                   November               301
2016               October               1947
                   June                  1720
                   September             1567
                   April                 1539
                   May                   1436
                   November              1360
                   August                1247
                   March                 1108
                   December              1072
                   July                  1043
                   February               930
                   January                438
2017               May                   2217
                   April                 1926
                   June                  1808
                   July                  1324
                   March                 1278
                   August                1123
                   January               1044
                   February               971
Name: arrival_date_month, dtype: int64

In [30]:
(
    b
    .query('hotel == "Resort Hotel" and is_canceled == 1')
    .groupby('arrival_date_year')
    .arrival_date_month
    .value_counts()
)

arrival_date_year  arrival_date_month
2015               September             551
                   October               411
                   August                366
                   July                  320
                   December              305
                   November              185
2016               August                578
                   October               567
                   April                 522
                   May                   479
                   July                  456
                   September             455
                   February              407
                   June                  376
                   March                 369
                   December              326
                   November              276
                   January               119
2017               August                693
                   July                  660
                   June                  631
                   May                   545
                   April                 537
                   March                 394
                   February              388
                   January               206
Name: arrival_date_month, dtype: int64

Here we are finding mean value of guest groups - adults, children, babies

In [32]:
b[['adults','children','babies']].mean()

adults      1.856403
children    0.103890
babies      0.007949
dtype: float64

In [33]:
#alternative solution
b[['adults','children','babies']].describe()

              adults       children         babies
count  119390.000000  119386.000000  119390.000000
mean        1.856403       0.103890       0.007949
std         0.579261       0.398561       0.097436
min         0.000000       0.000000       0.000000
25%         2.000000       0.000000       0.000000
50%         2.000000       0.000000       0.000000
75%         2.000000       0.000000       0.000000
max        55.000000      10.000000      10.000000

df['colF'] = df.apply(lambda row: categorise(row), axis=1)

sum_column = df["col1"] + df["col2"]

df["col3"] = sum_column

In [34]:
b['children_total'] = b.children + b.babies

In [35]:
b.children_total.max()

10.0

In [36]:
b.groupby('hotel', as_index=False)\
.agg({'children_total':'sum'})

          hotel  children_total
0    City Hotel          7640.0
1  Resort Hotel          5712.0

In [39]:
#alternative solution
b.groupby('hotel', as_index=False)\
.agg({'children_total':'mean'}) \
.round(2)

          hotel  children_total
0    City Hotel            0.10
1  Resort Hotel            0.14

one more question to go

In [40]:
b['has_kids'] = b.children_total > 0

In [41]:
b.has_kids

0         False
1         False
2         False
3         False
4         False
          ...
119385    False
119386    False
119387    False
119388    False
119389    False
Name: has_kids, Length: 119390, dtype: bool

In [42]:
b.query('is_canceled == 1 and has_kids == False').shape[0]

40965

In [43]:
# churn figures of people who has no kids
no_kids_churn = b.query('is_canceled == 1 and has_kids == False').shape[0] / b.query('has_kids == False').shape[0]
no_kids_churn = round(no_kids_churn*100,2)
no_kids_churn

37.22

In [44]:
# churn figures of people who has kids
with_kids_churn = b.query('is_canceled == 1 and has_kids == True').shape[0] / b.query('has_kids == True').shape[0]
with_kids_churn = round(with_kids_churn*100,2)
with_kids_churn

34.92